In [1]:
print("Hello World")

Hello World

# Importing ***pandas***

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.3'

# Creating Series

In [4]:
s1 = pd.Series([0,1,2,3,4])
print(s1)

0    0
1    1
2    2
3    3
4    4
dtype: int64

# Series - index

In [5]:
s1 = pd.Series([0,1,2,3,4], index=['a','b','c','d','e'])
print(s1)

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [6]:
import numpy as np
n = np.random.randn(5)
index=['a','b','c','d','e']

s = pd.Series(n,index)
print(s)

a   -1.418079
b   -0.187368
c    0.492343
d    0.520738
e    0.910747
dtype: float64

# Series from dictonary

In [7]:
d = {'a':1,'b':2,'c':3,'d':4}
s3 = pd.Series(d)
print(s3)

a    1
b    2
c    3
d    4
dtype: int64

# Modify Index

In [8]:
print(f"Before:\n{s1}")

s1.index = ['A','B','C','D','E']
print(f"After:\n{s1}")

Before:
a    0
b    1
c    2
d    3
e    4
dtype: int64
After:
A    0
B    1
C    2
D    3
E    4
dtype: int64

# Slicing (same as List)

In [9]:
a = s1[:3]
print(a)

A    0
B    1
C    2
dtype: int64

# Concat

In [10]:
print(pd.concat([s1,s3]))
print(pd.concat([s1,s3],ignore_index=True)) # this starts index from 0
# apppend has been depricated in latest version of pandas

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
dtype: int64
0    0
1    1
2    2
3    3
4    4
5    1
6    2
7    3
8    4
dtype: int64

# Drop

In [11]:
s4 = s3.drop('b') # doesn't make changes to orignal
print(s4)

a    1
c    3
d    4
dtype: int64

# Series Operations

In [12]:
s5 = pd.Series([10, 20, 30])
s6 = pd.Series([100, 200, 300, 400, 500])

# Add

In [13]:
print(s5.add(s6)) # Where number of column don't match NaN

0    110.0
1    220.0
2    330.0
3      NaN
4      NaN
dtype: float64

# Sub

In [14]:
print(s5.sub(s6))

0    -90.0
1   -180.0
2   -270.0
3      NaN
4      NaN
dtype: float64

# Mul

In [15]:
print(s5.mul(s6))

0    1000.0
1    4000.0
2    9000.0
3       NaN
4       NaN
dtype: float64

# Div

In [16]:
print(s5.div(s6))

0    0.1
1    0.1
2    0.1
3    NaN
4    NaN
dtype: float64

# Mean Median Mode Max Min

In [17]:
print("Mean:", s6.mean())
print("Median:", s6.median())

print("Max:", s6.max())
print("Min:", s6.min())

print("\nMode:\n",s.mode(),"\n")
# if NaN values are present they will be ignored

Mean: 300.0
Median: 300.0
Max: 500
Min: 100

Mode:
 0   -1.418079
1   -0.187368
2    0.492343
3    0.520738
4    0.910747
dtype: float64

# Dataframe From Dictonary

In [18]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

# Dataframe From a List of Lists

In [19]:
data = [
    ['Alice', 25, 'New York'],
    ['Bob', 30, 'Los Angeles'],
    ['Charlie', 35, 'Chicago']
]

df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

# Dataframe From a List of Dictionaries

In [20]:
data = [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'Los Angeles'},
    {'Name': 'Charlie', 'Age': 35, 'City': 'Chicago'}
]

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

# Dataframe From Numpy Arrays

In [21]:
data = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
df = pd.DataFrame(data, columns=['A', 'B', 'C'], index=['1','2','3'])
print("\nDataFrame from a Numpy Array:")
print(df)

DataFrame from a Numpy Array:
   A  B  C
1  1  2  3
2  4  5  6
3  7  8  9

# Data Type of columns

In [22]:
print(df.dtypes)

A    int64
B    int64
C    int64
dtype: object

# Head

In [23]:
data = {
    'ID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
    'Name': ['Name_1', 'Name_2', 'Name_3', 'Name_4', 'Name_5',
             'Name_6', 'Name_7', 'Name_8', 'Name_9', 'Name_10',
             'Name_11', 'Name_12', 'Name_13', 'Name_14', 'Name_15'],
    'Age': [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34],
    'City': ['City_1', 'City_2', 'City_3', 'City_4', 'City_5',
             'City_1', 'City_2', 'City_3', 'City_4', 'City_5',
             'City_1', 'City_2', 'City_3', 'City_4', 'City_5'],
    'Score': [0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140]
}

df = pd.DataFrame(data)
print(df)
print()


print(df.head(2)) # returns first 2 rows
print()
print(df.head()) # returns first 5 rows(default), if rows<5 returns all rows

    ID     Name  Age    City  Score
0    1   Name_1   20  City_1      0
1    2   Name_2   21  City_2     10
2    3   Name_3   22  City_3     20
3    4   Name_4   23  City_4     30
4    5   Name_5   24  City_5     40
5    6   Name_6   25  City_1     50
6    7   Name_7   26  City_2     60
7    8   Name_8   27  City_3     70
8    9   Name_9   28  City_4     80
9   10  Name_10   29  City_5     90
10  11  Name_11   30  City_1    100
11  12  Name_12   31  City_2    110
12  13  Name_13   32  City_3    120
13  14  Name_14   33  City_4    130
14  15  Name_15   34  City_5    140

   ID    Name  Age    City  Score
0   1  Name_1   20  City_1      0
1   2  Name_2   21  City_2     10

   ID    Name  Age    City  Score
0   1  Name_1   20  City_1      0
1   2  Name_2   21  City_2     10
2   3  Name_3   22  City_3     20
3   4  Name_4   23  City_4     30
4   5  Name_5   24  City_5     40

# Tail

In [24]:
print(df.tail())
print()
print(df.tail(3))

    ID     Name  Age    City  Score
10  11  Name_11   30  City_1    100
11  12  Name_12   31  City_2    110
12  13  Name_13   32  City_3    120
13  14  Name_14   33  City_4    130
14  15  Name_15   34  City_5    140

    ID     Name  Age    City  Score
12  13  Name_13   32  City_3    120
13  14  Name_14   33  City_4    130
14  15  Name_15   34  City_5    140

# Index

In [25]:
print(df.index)

RangeIndex(start=0, stop=15, step=1)

# Columns

In [26]:
print(df.columns)

Index(['ID', 'Name', 'Age', 'City', 'Score'], dtype='object')

# Values

In [27]:
print(df.values)

[[1 'Name_1' 20 'City_1' 0]
 [2 'Name_2' 21 'City_2' 10]
 [3 'Name_3' 22 'City_3' 20]
 [4 'Name_4' 23 'City_4' 30]
 [5 'Name_5' 24 'City_5' 40]
 [6 'Name_6' 25 'City_1' 50]
 [7 'Name_7' 26 'City_2' 60]
 [8 'Name_8' 27 'City_3' 70]
 [9 'Name_9' 28 'City_4' 80]
 [10 'Name_10' 29 'City_5' 90]
 [11 'Name_11' 30 'City_1' 100]
 [12 'Name_12' 31 'City_2' 110]
 [13 'Name_13' 32 'City_3' 120]
 [14 'Name_14' 33 'City_4' 130]
 [15 'Name_15' 34 'City_5' 140]]

# Describe

In [28]:
print(df.describe()) # gives stastical info

              ID        Age      Score
count  15.000000  15.000000   15.00000
mean    8.000000  27.000000   70.00000
std     4.472136   4.472136   44.72136
min     1.000000  20.000000    0.00000
25%     4.500000  23.500000   35.00000
50%     8.000000  27.000000   70.00000
75%    11.500000  30.500000  105.00000
max    15.000000  34.000000  140.00000

# Transpose

In [29]:
print(df.T)

           0       1       2       3       4       5       6       7       8   \
ID          1       2       3       4       5       6       7       8       9
Name   Name_1  Name_2  Name_3  Name_4  Name_5  Name_6  Name_7  Name_8  Name_9
Age        20      21      22      23      24      25      26      27      28
City   City_1  City_2  City_3  City_4  City_5  City_1  City_2  City_3  City_4
Score       0      10      20      30      40      50      60      70      80

            9        10       11       12       13       14
ID          10       11       12       13       14       15
Name   Name_10  Name_11  Name_12  Name_13  Name_14  Name_15
Age         29       30       31       32       33       34
City    City_5   City_1   City_2   City_3   City_4   City_5
Score       90      100      110      120      130      140

# Sort values by Column

In [30]:
print(df.sort_values(by='Score'))

    ID     Name  Age    City  Score
0    1   Name_1   20  City_1      0
1    2   Name_2   21  City_2     10
2    3   Name_3   22  City_3     20
3    4   Name_4   23  City_4     30
4    5   Name_5   24  City_5     40
5    6   Name_6   25  City_1     50
6    7   Name_7   26  City_2     60
7    8   Name_8   27  City_3     70
8    9   Name_9   28  City_4     80
9   10  Name_10   29  City_5     90
10  11  Name_11   30  City_1    100
11  12  Name_12   31  City_2    110
12  13  Name_13   32  City_3    120
13  14  Name_14   33  City_4    130
14  15  Name_15   34  City_5    140

# Slicing after sorting

In [31]:
print(df.sort_values(by="Score")[4:8])

   ID    Name  Age    City  Score
4   5  Name_5   24  City_5     40
5   6  Name_6   25  City_1     50
6   7  Name_7   26  City_2     60
7   8  Name_8   27  City_3     70

# Picking Columns

In [32]:
print(df[["Name","City"]])

       Name    City
0    Name_1  City_1
1    Name_2  City_2
2    Name_3  City_3
3    Name_4  City_4
4    Name_5  City_5
5    Name_6  City_1
6    Name_7  City_2
7    Name_8  City_3
8    Name_9  City_4
9   Name_10  City_5
10  Name_11  City_1
11  Name_12  City_2
12  Name_13  City_3
13  Name_14  City_4
14  Name_15  City_5

# Slicing(same as in list)

In [33]:
print(df[3:9])

   ID    Name  Age    City  Score
3   4  Name_4   23  City_4     30
4   5  Name_5   24  City_5     40
5   6  Name_6   25  City_1     50
6   7  Name_7   26  City_2     60
7   8  Name_8   27  City_3     70
8   9  Name_9   28  City_4     80

# iloc

In [34]:
# df.iloc[row_selection, column_selection]

print(df.iloc[:2]) # Selects first 2 rows
# iloc is similar to simple slicing but its recommended to use iloc as more versetile

print()
print(df.iloc[1:5, [0, 2]]) # Select rows 1 to 5 and columns 0 and 2

print()
print(df.iloc[[0, 2, 3]]) # Select rows 0, 2, and 3

print()
print(df.iloc[[0, 2, 3],[1,3]]) # Select rows 0, 2, and 3 and column 1 and 3

   ID    Name  Age    City  Score
0   1  Name_1   20  City_1      0
1   2  Name_2   21  City_2     10

   ID  Age
1   2   21
2   3   22
3   4   23
4   5   24

   ID    Name  Age    City  Score
0   1  Name_1   20  City_1      0
2   3  Name_3   22  City_3     20
3   4  Name_4   23  City_4     30

     Name    City
0  Name_1  City_1
2  Name_3  City_3
3  Name_4  City_4

# Shallow copy

In [35]:
df1 = df.copy()

# isnull

In [36]:
print(df.isnull()) # returns boolean dataframe, where True if orignal had null, else False

       ID   Name    Age   City  Score
0   False  False  False  False  False
1   False  False  False  False  False
2   False  False  False  False  False
3   False  False  False  False  False
4   False  False  False  False  False
5   False  False  False  False  False
6   False  False  False  False  False
7   False  False  False  False  False
8   False  False  False  False  False
9   False  False  False  False  False
10  False  False  False  False  False
11  False  False  False  False  False
12  False  False  False  False  False
13  False  False  False  False  False
14  False  False  False  False  False

# loc

In [37]:
df.loc[0,'Name'] = 'Shail' # loc is for changing values
print(df)

    ID     Name  Age    City  Score
0    1    Shail   20  City_1      0
1    2   Name_2   21  City_2     10
2    3   Name_3   22  City_3     20
3    4   Name_4   23  City_4     30
4    5   Name_5   24  City_5     40
5    6   Name_6   25  City_1     50
6    7   Name_7   26  City_2     60
7    8   Name_8   27  City_3     70
8    9   Name_9   28  City_4     80
9   10  Name_10   29  City_5     90
10  11  Name_11   30  City_1    100
11  12  Name_12   31  City_2    110
12  13  Name_13   32  City_3    120
13  14  Name_14   33  City_4    130
14  15  Name_15   34  City_5    140

# Mean Median Mode Min Max Sum with column name

In [38]:
print("Mean:",df['Age'].mean())
print("Median:",df['Age'].median())
print("Mode:\n",df['Age'].mode(),sep="")

print()
print("Min:",df['Age'].min())
print("Max:",df['Age'].max())
print("Sum:",df['Age'].sum())

Mean: 27.0
Median: 27.0
Mode:
0     20
1     21
2     22
3     23
4     24
5     25
6     26
7     27
8     28
9     29
10    30
11    31
12    32
13    33
14    34
Name: Age, dtype: int64

Min: 20
Max: 34
Sum: 405

# String Operations

In [39]:
data = {
    'Names': ['Alice', 'Bob', 'Charlie', np.nan, 'Eve'],
    'Cities': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Hobbies': ['Reading', np.nan, 'Gaming', 'Hiking', 'Cooking']
}

df = pd.DataFrame(data)
print(df)

     Names       Cities  Hobbies
0    Alice     New York  Reading
1      Bob  Los Angeles      NaN
2  Charlie      Chicago   Gaming
3      NaN      Houston   Hiking
4      Eve      Phoenix  Cooking

# Upper

In [40]:
print(df['Names'].str.upper())

0      ALICE
1        BOB
2    CHARLIE
3        NaN
4        EVE
Name: Names, dtype: object

# Lower

In [41]:
print(df['Names'].str.lower())

0      alice
1        bob
2    charlie
3        NaN
4        eve
Name: Names, dtype: object

# Fill NaN Values

In [42]:
print("Before:\n",df,sep="")
print()

print(df.fillna(4)) # will set all NaN value with NaN

Before:
     Names       Cities  Hobbies
0    Alice     New York  Reading
1      Bob  Los Angeles      NaN
2  Charlie      Chicago   Gaming
3      NaN      Houston   Hiking
4      Eve      Phoenix  Cooking

     Names       Cities  Hobbies
0    Alice     New York  Reading
1      Bob  Los Angeles        4
2  Charlie      Chicago   Gaming
3        4      Houston   Hiking
4      Eve      Phoenix  Cooking

# Drop NaN rows

In [43]:
print("Before:\n",df,sep="")
print()

print(df.dropna())# deletes all rows where NaN was present

Before:
     Names       Cities  Hobbies
0    Alice     New York  Reading
1      Bob  Los Angeles      NaN
2  Charlie      Chicago   Gaming
3      NaN      Houston   Hiking
4      Eve      Phoenix  Cooking

     Names    Cities  Hobbies
0    Alice  New York  Reading
2  Charlie   Chicago   Gaming
4      Eve   Phoenix  Cooking

# Create CSV file from DF

In [44]:
df.to_csv('trial.csv')

# Read csv file

In [45]:
df1 = pd.read_csv('trial.csv')
df1.head(3)

   Unnamed: 0    Names       Cities  Hobbies
0           0    Alice     New York  Reading
1           1      Bob  Los Angeles      NaN
2           2  Charlie      Chicago   Gaming

# DF to Excel

In [46]:
df.to_excel('trial.xlsx', sheet_name='Sheet1')

# Read Excel

In [47]:
df1 = pd.read_excel('trial.xlsx', 'Sheet1', na_values=['NA'])
print(df1)

   Unnamed: 0    Names       Cities  Hobbies
0           0    Alice     New York  Reading
1           1      Bob  Los Angeles      NaN
2           2  Charlie      Chicago   Gaming
3           3      NaN      Houston   Hiking
4           4      Eve      Phoenix  Cooking

# ***The End***